# InvalidProfileError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..InvalidProfileError Property
BuiltInFailures..::..SketchFailures Class See Also
---
One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidProfileError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidProfileError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidProfileError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace